Repository: 84000/data-translation-memory
Catalog: toh846-v2.tmx
Source language: bo
Languages: en

source: ༄༅༅། །སྤྱན་འདྲེན་རྒྱུད་གསུམ་པ།
en: The Threefold Invocation Ritual

source: བླ་མའི་བླ་མ་བླ་མེད་དཀོན་མཆོག་གསུམ། །ཆེ་བའི་ཆེ་མཆོག་དབང་མཆོག་དམ་པ་ལ། །གུས་པས་ཕྱག་འཚལ་དང་བས་སྐྱབས་སུ་མཆི། །
en: I take refuge with sincere devotion and reverence In the highest guru, the unsurpassed Three Jewels, And the greatest of them all, the sublime supreme lord.

source: གནམ་སའི་མངའ་བདག་སྐྱེ་དགུའི་ལོངས་སྤྱོད་གཞི། །བསྟན་པ་དམ་པ་ཆོས་ཀྱི་མགོན་མཛད་པ། །ཚངས་པ་བརྒྱ་བྱིན་
en: Brahmā and Śakra—lords of heaven and earth, Source of all beings’ wealth, and protectors Of the Dharma, the supreme teaching;

source: རྒྱལ་ཆེན་ཡུལ་འཁོར་སྲུང་། །འཕགས་སྐྱེས་མིག་མི་བཟང་དང་ལུས་ངན་བོ། །འཇིག་རྟེན་སྐྱོང་བ་དབང་པོ་མེ་ལྷ་དང་། །གཤིན་རྗེ་བདེན་བྲལ་ཆུ་ལྷ་རླུང་གི་ལྷ། །རྣམ་ཐོས་བུ་དང་དབང་བདག་ས་ཡི་ལྷ། །
en: great kings Dhṛtarāṣṭra, Virūḍhaka, Noble Virūpākṣa, and Kubera; World protectors Indra, Agni, Yama, Nairṛta, Varuṇa, Vāyu, Vaiśravaṇa, Īśāna, and Pṛthivīdevatā;

source: ཉི་ཟླ་གཟའ་སྐར་ཕྱོགས་ཀྱི་གླང་པོ་རྣམས། །བློན་པོ་སྡེ་དཔོན་ལྷ་མོ་
en: The Sun, Moon, grahas, nakṣatras, the elephants of the quarters, And the general, minister, and queen;

source: ཕྱོགས་མཚམས་སྲུང་། །བཙུན་མོ་སྲས་བཅས་སོ་སོའི་འཁོར་ཀུན་དང་། །
en: the guardians of the directions, Each with their full retinue of queens and princes;

source: ལྷ་ཡི་སྡེ་དཔོན་ཆེན་པོར་མཚན་གྲགས་པ། །ཁྱབ་འཇུག་ཚོགས་བདག་ནནྟི་ཀརྟི་ཀ། །
en: Renowned great commanders of the gods Such as Viṣṇu, Gaṇapati, Nandi, and Kārttikeya;

source: ནག་པོ་ཆེན་པོ་སྟོབས་ཆེན་སྟོབས་པོ་ཆེ། །གནོད་འཛིན་པདྨ་པདྨ་ཆེན་པོ་དང་། །དུང་དང་དུང་ཆེན་གང་པོ་ཤིན་ཏུ་གང་། །
en: Great and powerful Mahākāla, Mahābala, Jambhala, Padma, and Mahāpadma, Śaṅkha and Mahāśaṅkha, Pūrṇa and Supūrṇa,

source: མགྲིན་བཟང་གང་བ་བཟང་པོ་ནོར་བུ་བཟང་། །བུམ་རྣ་དྲིལ་རྣ་རྣ་གསུམ་རྣ་བོ་ཆེ། །ཡང་དག་ཤེས་དང་ཡང་དག་རྒྱལ་བ་དང་། །
en: Sugrīva, Pūrṇabhadra, Maṇibhadra, Kumbhakarṇa, Ghaṇṭākarṇa, Trikarṇa, Mahākarṇa, Sañjñeya and Sañjaya,

source: རྒྱལ་བའི་ཁྱུ་མཆོག་འབྲོག་གནས་གངས་ལ་གནས། །བདེ་རི་ལྔས་རྩེན་ལྔ་ལེན་ཚིགས་ལྔ་སེར། །མགྲིན་བཅུ་རྣམ་འཇིགས་འབྲུག་སྒྲ་ནམ་མཁའི་དབྱངས། །
en: Jinarṣabha, Āṭavaka, Haimavata, Sātāgiri, Pāñcika, Pāñcāla­gaṇḍa, Pāñcālaka, Daśagrīva, Vibhīṣaṇa, Meghanāda, Gagana­ghoṣa,

source: སྟོང་གསུམ་རྒྱ་མཚོ་དགའ་བོ་བསྙེན་དགའ་བོ། །མ་དྲོས་གཟི་ཅན་ནོར་རྒྱས་གདོན་ལ་འཇེབས། །དྲང་སྲོང་རིག་འཛིན་ཆར་སྤྲིན་ལོ་ཏོག་ལྷ། །
en: Triśirṣaka, Sāgara, Nanda, Upananda, Anavatapta, Manasvin, Vāsuki, and the hosts of grahas; Rṣis, vidyādharas, gods of the rains and harvest,

source: ལམ་ལྷ་ཉིན་མཚན་དུས་མཚམས་ཚེས་གྲངས་ཡུད། །
en: Gods of the road, of the day, the night, conjunctions, lunar phases, and moments;

source: ཧ་ནུ་མན་ཏ་ལ་སོགས་མཐུ་ཆེན་དང་། །
en: Powerful beings such as Hanuman and the like;

source: ཚིག་དབང་ལྷ་མོ་སྒྲ་དབྱངས་དབྱངས་ཅན་དང་། །བེའུ་འདྲ་དཔལ་གྱི་ལྷ་མོ་འོད་ཟེར་ཅན། །དཀར་ཤམ་བརྗོད་སྐྱོབ་གང་གཱ་ཡ་མུ་ན། །སྲས་འཕན་དུང་ཅན་རི་མཁར་ནག་མོ་དང་། །
en: Vāgīśvarī, Svaraghoṣā, and Sarasvatī; Vatsavatī, Śrīmati, Mārīcī, Gaurī, Guardian of Speech, Gangā, Yamunā, Hārītī, Śaṅkhinī, Pārvatī, Durgā, and Kālī;

source: མ་བདུན་སྲིང་མོ་བདུན་དང་སྲིང་མོ་བཞི། །
en: The seven mothers, the seven sisters, and the four sisters;

source: ནག་མོ་ཆེན་མོ་རལ་པ་གཅིག་ལ་སོགས། །ལྷ་མོ་ཆེན་མོ་གནོད་སྦྱིན་ཆེན་མོ་དང་། །
en: Great goddesses and great yakṣiṇīs Such as Mahākālī and Ekajaṭī and so forth;

source: སྲིན་མོ་ཆེན་མོ་ཤ་ཟ་ཆེན་མོ་དང་། །གཞོན་ནུའི་སྐུ་འཚོ་རྫུ་འཕྲུལ་དབང་གིས་འཕགས། །སླག་ཆེན་བརྗིད་པ་ལྷ་དམག་གཡུལ་དུ་བསྟོད། །
en: Great rākṣasīs and great piśācīs Revered for their youthful forms, nurturing, and magical powers, Awesome in their great hides and praised in battle by the army of the gods;

source: རྨད་གྲགས་ཆེན་པོའི་དགེ་བསྙེན་ཆེན་པོ་དང་། །ལྷ་སྲས་གཞོན་ནུ་ཀླུ་སྲས་གཞོན་ནུ་དང་། །རིག་འཛིན་གཞོན་ནུ་དྲང་སྲོང་གཞོན་ནུ་དང་། །བི་ཀྵུས་བསྟེན་པའི་གཞོན་ནུ་ལྔ་བརྒྱ་སྤུན། །
en: Marvelous, renowned great lay practitioners, Young gods and nāgas, Young vidyādharas and ṛṣis, And their five hundred kinsmen, all of them venerated by monks;

source: གནོད་སྦྱིན་གཞོན་ནུ་ཏི་ར་ཀ་ལ་སོགས། །གཟི་བརྗིད་ཆེན་པོའི་གཞོན་སྡེ་ཐམས་ཅད་དང་། །
en: This entire group of resplendent youthful ones Including the young yakṣa Tiraka and the like;

source: སྐྱེ་དགུའི་བདག་པོ་ལ་སོགས་ལྷ་དང་ཀླུ། །
en: Gods and nāgas who are lords of all beings;

source: གནོད་སྦྱིན་དྲི་ཟ་ལྟོ་འཕྱེ་ལྷ་མ་ཡིན། །གསེར་འདབ་གྲུལ་བུམ་སྲིན་པོ་མིའམ་ཅི། །འབྱུང་པོ་ཤ་ཟ་ཡུལ་བདག་འདྲེ་ལ་སོགས། །
en: Yakṣas, gandharvas, uragas, asuras, Garuḍas, kumbhāṇḍas, rākṣasas, kinnaras, Bhūtas, piśācas, local deities, and evil spirits;

source: ཅང་ཤེས་སྙིང་རྗེའི་ལམ་དུ་ཞུགས་དགུ་དང་། །རིག་པའི་ལྕགས་ཀྱུས་ཟིན་པ་ཀུན་གསོན་ཅིག། །
en: All you wise ones who have entered the path of compassion, All you who are held by the hook of the vidyāmantra , listen to me.

source: གང་གི་མིང་ལའང་བཀྲ་ཤིས་དཔལ་འབར་བ། །ཡི་གེ་གཉིས་འབྲེལ་དཀོན་མཆོག་གསུམ་གྱི་མཚན། །སྐྱེས་བུ་གང་ཞིག་ཉན་ཏམ་འདོན་པ་ཡང་། །གཞའ་གསང་ཡུན་གྱི་ཆུ་སྲིད་འཐོབ་འགྱུར་ན། །ཡོན་ཏན་ཕུན་སུམ་དཔག་ཡས་དཀོན་མཆོག་ལ། །བསྙེན་བཀུར་མཉེས་བྱེད་བཀའ་ལ་གུས་པ་དང་། །ཆོས་ཐོས་ཉམས་སུ་ལེན་པ་ཅི་ཞིག་སྨོས། །
en: May (insert name), a person blazing with good fortune Who has heard and recited the names Of the Three Jewels with their vowels and consonants Have a prosperous and long reign, Serve and venerate the Three Jewels, which possess immeasurable Benefits and good qualities, have faith in the scriptures, And, of course, study and practice the Dharma.

source: དེ་བས་གསུང་རབ་དཔག་བསམ་རྒྱས་པ་ཡི། །ལྷ་ཡི་ལོངས་སྤྱོད་ཚལ་དུ་ཀུན་གཤེགས་ཏེ། །
en: Upon death, may (insert name) depart for the divine pleasure groves With their vast bounty of scriptures.

source: ཆོས་རྗེ་ཉི་མ་ཐམས་ཅད་མཁྱེན་པའི་བཀའ། །བདུད་སྡེ་ལྟ་མིན་གཡུལ་ལས་རྒྱལ་བྱེད་པ། །རིན་ཆེན་འོད་མཆོག་ལྷ་དབང་གཙུག་གི་རྒྱན། །བག་ཡོད་དད་པའི་སྤྱི་བོས་བླང་བར་མཛོད། །
en: This one who is conscientious and devoted is crowned With the teachings of the sun-like omniscient Dharma lord, The supreme radiant jewel that crowns the king of the gods Who brings victory in battle over the asuras and hosts of Māra.

source: ཀྱེ་རྒྱལ་བའི་སྲས་ཁྱོད་ཚུར་ཤོག །
en: Approach, children of the Victors!

source: བདག་དང་སེམས་ཅན་ཀུན་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བགྱིས་ལ།
en: Knowing that we and all beings are already beyond suffering and

source: སེམས་ཅན་མ་རྒལ་བས་མ་འཇིགས་པར་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་བཙལ་བས་མི་ངོམས་པ་ལ་སེམས་ཞོག་ཤིག །
en: thus not fearing that sentient beings will fail to transcend it, may we still insatiably cultivate the accumulations of merit and wisdom.

source: མངོན་པར་འདུ་བྱེད་པའི་རང་བཞིན་གྱི་མཚན་ཉིད་ཀྱང་མ་གཏང་ཤིག །
en: May we know that things are intrinsically conditioned, yet not dismiss their characteristics.

source: སངས་རྒྱས་ཀྱི་གཟུགས་ཀྱི་སྐུ་ཡང་མ་དོར་ཅིག །
en: May we not reject the form body of a buddha

source: འདོད་ཆགས་དང་བྲལ་བའང་ཐོབ་པར་གྱིས་ཤིག །
en: May we [not reject the form body of a buddha,] yet attain freedom from all attachment.

source: ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་བཙལ་བར་གྱིས་ཤིག །
en: May we be free from attachment to all phenomena, yet seek the wisdom that knows everything.

source: ཆོས་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་འཇོག་པ་མེད་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་སྦྱང་བར་གྱིས་ཤིག །
en: May we completely purify all phenomena as buddha realms without depending on others,

source: ཞིང་གི་མཚན་ཉིད་ནམ་མཁའ་ལྟ་བུར་ཡང་ཤེས་པར་གྱིས་ཤིག །
en: May we [completely purify all phenomena as buddha realms without depending on others,] yet understand the space-like characteristic of buddha realms.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བས་མ་སྐྱོ་ཤིག །
en: May we never weary of bringing beings to maturity,

source: བདག་མེད་པའི་མཚན་ཉིད་ཀྱང་མ་སྤོང་ཤིག །
en: May we [never weary of bringing beings to maturity,] yet never abandon the characteristics of lacking self-identity.

source: མངོན་པར་ཤེས་པ་ལ་ཡང་རྣམ་པར་འཕྲུལ་པར་གྱིས་ཤིག །
en: May we magically display supernatural powers,

source: ཆོས་ཀྱི་དབྱིངས་ལས་ཀྱང་མ་གཡོ་ཤིག །
en: May we [magically display supernatural powers], yet never waver from the sphere of reality.

source: བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཡང་མ་གཏང་ཤིག །
en: May we not stop setting our mind on enlightenment,

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཡང་འབྱུང་བར་གྱིས་ཤིག །
en: May we [not stop setting our mind on enlightenment,] yet may omniscient wisdom arise in us.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་གྱིས་ཤིག །
en: May we satisfy all beings by turning the wheel of the Dharma,

source: ཆོས་ཉིད་བརྗོད་དུ་མེད་པ་ལས་ཀྱང་འདའ་བར་མ་བྱེད་ཅིག །
en: May we [satisfy all beings by turning the wheel of the Dharma,] yet not pass beyond the inexpressible nature of reality.

source: དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དང་བྱིན་གྱི་བརླབས་ཀྱང་ཡོངས་སུ་སྟོན་ཅིག །
en: May we demonstrate the magical emanations and blessings of a tathāgata,

source: བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱང་མ་དོར་ཅིག །
en: May we [demonstrate the magical emanations and blessings of a tathāgata], without nevertheless discarding the body of a bodhisattva, and

source: སྐྱེ་བའི་སྐྱེ་མཆེད་ཐམས་ཅད་དུ་ཡང་སྣང་བར་གྱིས་ཤིག །
en: yet in all the perceptions of beings may we appear and

source: ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཆེན་པོ་ཡང་ཡོངས་སུ་སྟོན་ཅིག་ཅེས།
en: [yet in all the perceptions of beings] may we [appear and] then display the great parinirvāṇa.

source: ཀྱེ་རྒྱལ་བའི་སྲས་འདི་དག་ནི་ལྟ་བའི་ཆོས་ཟུང་དང་སྣེལ་ཞིར་སྒྲུབ་པ་མངོན་པར་བསྒྲུབ་པ་རྣམས་ཉེ་བར་སྒྲུབ་པ་འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཡང་དག་ཕུལ་གྱི་ཆོས་བཅུ་པ་ཞེས་བྱའོ། །
en: Children of the Victors, uphold these aspects of the teachings and practice these obverse and direct ways of engaging in practice. These ten teachings are the most excellent activity of a buddha.

source: ཀྱེ་རྒྱལ་བའི་སྲས་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཏེ།
en: Children of the Victor, these are the awakened activity of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རང་བྱུང་གི་ཕྲིན་ལས་གཞན་གྱི་དྲིང་འཇོག་པ་མེད་པར་བླ་ན་མེད་པའི་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་བ་དག་གོ། །
en: The spontaneous activity of the bodhisattvas is independent of others and is the perfect attainment of unsurpassed awakening.

source: ལྷ་ཡི་རྒྱལ་པོ་དབང་ཆེན་མཆོག་སྦྱིན་གཙོ། །དཔའ་བོ་འཇིགས་མེད་འཇིག་རྟེན་ཀུན་ལ་གྲགས། །ཤེས་རབ་འོད་གསལ་ཟླ་བ་ཉ་བའི་ཞལ། །སྐྱེས་མཆོག་སྨོན་ལམ་ཕྲིན་ལས་གཅིག་པའི་མཆེད། །
en: King of the gods, great sovereign, boon-granting lord, Fearless hero famous throughout the world Whose face is radiant with insight like the full moon— The aspiration and activity of a great being is your sole companion.

source: ཚངས་པ་བརྒྱ་བྱིན་འཇིག་རྟེན་སྐྱོང་ལ་སོགས། །རྡོ་རྗེ་ཏིང་འཛིན་རི་རབ་སྲུབ་ཤིང་དང་། །སྙིང་རྗེ་བརྩོན་འགྲུས་ཀླུ་ཡི་སྲུབ་ཐག་གིས། །ཤེས་རབ་ཆེན་པོའི་རྒྱ་མཚོ་བསྲུབས་པའི་བཅུད། །དམ་ཆོས་བདུད་རྩིའི་མགྲོན་དུ་གཤེགས་ཀུན་ལ། །
en: Brahmā, Śakra, and the other world protectors Used the vajra-like samādhi, Mt. Sumeru, as the churning stick And, along with compassion and effort, the nāga rope, Churned forth an elixir, the holy Dharma, From the ocean of great insight that spread everywhere like a feast of amṛta.

source: ཆོས་བསྒྲགས་བསོད་ནམས་དབྱིག་ཀྱང་སྤྱིར་འབུལ་གྱིས། །སྲིན་དམག་ལྷ་མིན་གཡུལ་ལས་རྒྱལ་བ་དང་། །
en: With this jewel of merit, the renowned Dharma, as the crown jewel, You were victorious in battle over the armies of rākṣasas and the asuras.

source: ལྷ་ཡི་རྒྱལ་སྲིད་དབུ་རྨོག་བཙན་པར་བསྔོ། །
en: I dedicate this to the mighty helmet of the kingdom of the gods.

source: གཟི་བྱིན་གཡོག་འཁོར་ལོངས་སྤྱོད་འཕེལ་བ་དང་། །མཐུ་རྩལ་གོ་འཕང་ཁྱད་པར་ཐོབ་པར་བསྔོ། །
en: I dedicate this so that our radiance, retinues, and wealth may increase And in particular so that we may attain powerful and strong standings.

source: རྫུ་འཕྲུལ་མངོན་ཤེས་ཕ་རོལ་ཕྱིན་ལ་སོགས། །རྣམ་པར་ཐར་པའི་སྒོ་ཀུན་རྫོགས་པ་དང་། །དགེ་བའི་ཕྲིན་ལས་དགོངས་དགུ་གྲུབ་པར་བསྔོ། །
en: I dedicate this so that we may perfect all the means of liberation Such as the magical powers, supernatural cognitions, and perfections And accomplish all our virtuous actions and intentions.

source: དམ་ཆོས་བདུད་རྩིའི་བདེ་བས་ལུས་ཁྱབ་སྟེ། །སྡུག་བསྔལ་གནོད་པའི་རྒྱུད་ལས་གྲོལ་བར་བསྔོ། །
en: I dedicate this so that our bodies may be pervaded by the bliss of the Dharma nectar, Liberating us from minds that are plagued by suffering.

source: དགེ་བའི་བཤེས་གཉེན་བཀའ་དྲིན་བྱམས་པའི་གཉེན། །བདག་ཅག་ཉོན་མོངས་མཚོན་གྱིས་རྨས་པ་རྣམས། །ཐུགས་རྗེའི་བྱིན་གྱི་བརླབས་ཀྱིས་བསྐྱང་བ་དང་། །གང་གིས་གང་ལ་སྤྱི་བོས་མཐུ་སྐྱེད་ཅིང་། །དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་བསྲུང་བར་གསོལ། །
en: Spiritual teachers, kind and loving friends, We are wounded by the blade of the afflictions. Please sustain us with your compassionate blessing And ensure that whomever is granted the crown is powerful And protects the teachings of the Tathāgata.

source: མ་འོས་འཁྲུལ་པའི་ནོངས་པ་མཆིས་སོ་འཚལ། །
en: We are faulted beings who are confused and act inappropriately—please forgive us!

source: དུས་རིག་རྒྱུད་མཁྱེན་ཀུན་ལ་བཟོད་པར་གསོལ། །
en: Those who know the time, vidyāmantra, and ritual, please be patient with us.

source: ལྷ་ཚོགས་ཆོས་ཀྱི་སྦྱིན་པའི་བཀྲ་ཤིས་ཀྱིས། །ཕུན་སུམ་ཚོགས་འཛིན་དམ་ཆོས་རྒྱས་པར་སྨོན། །
en: We pray that the good fortune of this Dharma offering to the hosts of gods Shall ensure prosperity and cause the supreme Dharma to flourish.

source: རྒྱུད་གསུམ་པ་རྫོགས་སོ།། །།
en: This concludes “The Threefold [Invocation] Ritual.”
